
Feature: Въвеждане на оценка

  Scenario: Въвеждане на валидна оценка от преподавател
    Given Преподавателя отваря страницата за въвеждане на оценка.
    When Въвежда предмета, по който преподава "English"
    And Въвежда име на ученик "Maria"
    And Въвежда оценка "6"
    And Натиска върху бутона за добавяне на оценката.
    Then Вижда съобщение "Успешно добавихте оценката!".
    
     Scenario: Въвеждане на невалидна оценка
    Given Преподавателя отваря страницата за въвеждане на оценка.
    When Въвежда предмета, по който преподава "English"
    And Въвежда име на ученик "Maria"
    And Въвежда оценка "1"
    And Натиска върху бутона за добавяне на оценката.
    Then Вижда съобщение "Моля, въведете оценка от 2 до 6!".
    
    Scenario: Въвеждане на оценка без име
    Given Преподавателя отваря страницата за въвеждане на оценка.
    When Въвежда предмета, по който преподава "English"
    And Въвежда оценка "6"
    And Натиска върху бутона за добавяне на оценката.
    Then Вижда съобщение "Моля, въведете име на ученик!".
    
    Scenario: Въвеждане на оценка без предмет
    Given Преподавателя отваря страницата за въвеждане на оценка.
    And Въвежда име на ученик "Maria13"
    And Въвежда оценка "6"
    And Натиска върху бутона за добавяне на оценката.
    Then Вижда съобщение "Моля, въведете предмет!".
    
       Scenario: Въвеждане на оценка без оценка
    Given Преподавателя отваря страницата за въвеждане на оценка.
    When Въвежда предмета, по който преподава "English"
    And Въвежда име на ученик "Maria13"
    And Натиска върху бутона за добавяне на оценката.
    Then Вижда съобщение "Моля, въведете оценка!".
  
  
  

